In [3]:
import pandas as pd
from sqlalchemy import create_engine

In [5]:
usuario = 'postgres'
contraseña = 'postgre'
host = 'localhost'
puerto = '5432'
base_de_datos = 'postgres'

In [7]:
conexion = f'postgresql+psycopg2://{usuario}:{contraseña}@{host}:{puerto}/{base_de_datos}'

In [9]:
conn = create_engine(conexion)

In [11]:
conn

Engine(postgresql+psycopg2://postgres:***@localhost:5432/postgres)

In [13]:
try:
    version = pd.read_sql("SELECT version();", conn).iloc[0, 0]
    print("Conexión exitosa con SQLAlchemy.")
    print(f"Versión del servidor PostgreSQL: {version}")
except Exception as e:
    print(f"Ocurrió un error al conectar con SQLAlchemy: {e}")

Conexión exitosa con SQLAlchemy.
Versión del servidor PostgreSQL: PostgreSQL 17.5 on x86_64-windows, compiled by msvc-19.43.34808, 64-bit

In [16]:
consulta_1 = """
SELECT table_name
FROM information_schema.tables
WHERE table_schema = 'dw_tfm_restaurantes'
ORDER BY table_name;
"""
pd.read_sql(consulta_1, conn)

               table_name
0           aparcamientos
1              dim_barrio
2            dim_distrito
3          flujo_peatones
4               licencias
5    menu_restaurantes_mx
6        poblacion_madrid
7   residentes_demografia
8            restaurantes
9                terrazas
10     transporte_publico

In [18]:
consulta_2 = """
SELECT *
FROM 
  information_schema.columns 
WHERE 
  table_name = 'poblacion_madrid';
"""
pd.read_sql(consulta_2, conn)

,table_catalog,table_schema,table_name,column_name,ordinal_position,column_default,is_nullable,data_type,character_maximum_length,character_octet_length,...,is_identity,identity_generation,identity_start,identity_increment,identity_maximum,identity_minimum,identity_cycle,is_generated,generation_expression,is_updatable
0,postgres,dw_tfm_restaurantes,poblacion_madrid,id_poblacion,1,nextval('dw_tfm_restaurantes.poblacion_madrid_...,NO,integer,NaN,NaN,...,NO,None,None,None,None,None,NO,NEVER,None,YES
1,postgres,dw_tfm_restaurantes,poblacion_madrid,fecha,2,None,YES,character varying,50.0,200.0,...,NO,None,None,None,None,None,NO,NEVER,None,YES
2,postgres,dw_tfm_restaurantes,poblacion_madrid,cod_municipio,3,None,YES,integer,NaN,NaN,...,NO,None,None,None,None,None,NO,NEVER,None,YES
3,postgres,dw_tfm_restaurantes,poblacion_madrid,municipio,4,None,YES,character varying,100.0,400.0,...,NO,None,None,None,None,None,NO,NEVER,None,YES
4,postgres,dw_tfm_restaurantes,poblacion_madrid,cod_distrito,5,None,YES,integer,NaN,NaN,...,NO,None,None,None,None,None,NO,NEVER,None,YES
5,postgres,dw_tfm_restaurantes,poblacion_madrid,distrito,6,None,YES,character varying,100.0,400.0,...,NO,None,None,None,None,None,NO,NEVER,None,YES
6,postgres,dw_tfm_restaurantes,poblacion_madrid,cod_barrio,7,None,YES,integer,NaN,NaN,...,NO,None,None,None,None,None,NO,NEVER,None,YES
7,postgres,dw_tfm_restaurantes,poblacion_madrid,barrio,8,None,YES,character varying,100.0,400.0,...,NO,None,None,None,None,None,NO,NEVER,None,YES
8,postgres,dw_tfm_restaurantes,poblacion_madrid,num_personas,9,None,YES,double precision,NaN,NaN,...,NO,None,None,None,None,None,NO,NEVER,None,YES
9,postgres,dw_tfm_restaurantes,poblacion_madrid,num_personas_hombres,10,None,YES,double precision,NaN,NaN,...,NO,None,None,None,None,None,NO,NEVER,None,YES
10,postgres,dw_tfm_restaurantes,poblacion_madrid,num_personas_mujeres,11,None,YES,double precision,NaN,NaN,...,NO,None,None,None,None,None,NO,NEVER,None,YES

In [20]:
consulta_3= """
SELECT 
  column_name, 
  data_type, 
  character_maximum_length, 
  is_nullable, 
  column_default 
FROM 
  information_schema.columns 
WHERE 
  table_name = 'poblacion_madrid'
ORDER BY
    ordinal_position
"""

pd.read_sql(consulta_3, conn)

,column_name,data_type,character_maximum_length,is_nullable,column_default
0,id_poblacion,integer,NaN,NO,nextval('dw_tfm_restaurantes.poblacion_madrid_...
1,fecha,character varying,50.0,YES,None
2,cod_municipio,integer,NaN,YES,None
3,municipio,character varying,100.0,YES,None
4,cod_distrito,integer,NaN,YES,None
5,distrito,character varying,100.0,YES,None
6,cod_barrio,integer,NaN,YES,None
7,barrio,character varying,100.0,YES,None
8,num_personas,double precision,NaN,YES,None
9,num_personas_hombres,double precision,NaN,YES,None
10,num_personas_mujeres,double precision,NaN,YES,None

Leer fichero

In [64]:
df_poblacion_madrid = pd.read_csv("./ficheros/B7_Poblacion_Madrid.csv")
df_poblacion_madrid.head(10)

,fecha,cod_municipio,municipio,cod_distrito,distrito,cod_barrio,barrio,num_personas,num_personas_hombres,num_personas_mujeres
0,1 de enero de 2024,28079,Madrid,1,Centro,1,Centro,145.411,73.734,71.677
1,1 de enero de 2024,28079,Madrid,2,Arganzuela,2,Arganzuela,156.559,73.311,83.248
2,1 de enero de 2024,28079,Madrid,3,Retiro,3,Retiro,119.757,54.339,65.418
3,1 de enero de 2024,28079,Madrid,4,Salamanca,4,Salamanca,149.778,66.374,83.404
4,1 de enero de 2024,28079,Madrid,5,Chamartín,5,Chamartín,148.111,66.860,81.251
5,1 de enero de 2024,28079,Madrid,6,Tetuán,6,Tetuán,166.211,76.072,90.139
6,1 de enero de 2024,28079,Madrid,7,Chamberí,7,Chamberí,141.984,62.918,79.066
7,1 de enero de 2024,28079,Madrid,8,Fuencarral-El Pardo,8,Fuencarral-El Pardo,253.898,119.721,134.177
8,1 de enero de 2024,28079,Madrid,9,Moncloa-Aravaca,9,Moncloa-Aravaca,125.223,58.121,67.102
9,1 de enero de 2024,28079,Madrid,10,Latina,10,Latina,250.396,116.437,133.959

In [66]:
df_poblacion_madrid.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1064 entries, 0 to 1063
Data columns (total 10 columns):
 #   Column                Non-Null Count  Dtype
---  ------                --------------  -----
 0   fecha                 1064 non-null   object
 1   cod_municipio         1064 non-null   int64
 2   municipio             1064 non-null   object
 3   cod_distrito          1064 non-null   int64
 4   distrito              1064 non-null   object
 5   cod_barrio            1064 non-null   int64
 6   barrio                1064 non-null   object
 7   num_personas          1057 non-null   float64
 8   num_personas_hombres  1057 non-null   float64
 9   num_personas_mujeres  1057 non-null   float64
dtypes: float64(3), int64(3), object(4)
memory usage: 83.3+ KB

In [68]:
df_poblacion_madrid.describe(include="all").T

,count,unique,top,freq,mean,std,min,25%,50%,75%,max
fecha,1064,7,1 de enero de 2024,152,NaN,NaN,NaN,NaN,NaN,NaN,NaN
cod_municipio,1064.0,NaN,NaN,NaN,28079.0,0.0,28079.0,28079.0,28079.0,28079.0,28079.0
municipio,1064,1,Madrid,1064,NaN,NaN,NaN,NaN,NaN,NaN,NaN
cod_distrito,1064.0,NaN,NaN,NaN,10.736842,5.898508,1.0,6.0,11.0,15.0,21.0
distrito,1064,21,Ciudad Lineal,70,NaN,NaN,NaN,NaN,NaN,NaN,NaN
cod_barrio,1064.0,NaN,NaN,NaN,96.927632,64.500946,1.0,34.75,94.5,152.25,215.0
barrio,1064,217,Marroquina,7,NaN,NaN,NaN,NaN,NaN,NaN,NaN
num_personas,1057.0,NaN,NaN,NaN,44.52325,59.030616,1.165,17.43,24.951,41.984,945.0
num_personas_hombres,1057.0,NaN,NaN,NaN,37.365903,116.268189,1.23,8.349,11.977,20.857,996.0
num_personas_mujeres,1057.0,NaN,NaN,NaN,40.688588,121.249589,1.051,9.494,13.939,23.16,992.0

In [70]:
df_poblacion_madrid.isnull().sum()

fecha                   0
cod_municipio           0
municipio               0
cod_distrito            0
distrito                0
cod_barrio              0
barrio                  0
num_personas            7
num_personas_hombres    7
num_personas_mujeres    7
dtype: int64

Duplicados para eliminar

In [72]:
df_poblacion_madrid.duplicated().values.any()

np.False_

Eliminar los nulos específicos en las columnas de conteo

In [74]:
columnas_poblacion = ['num_personas', 'num_personas_hombres', 'num_personas_mujeres']
df_poblacion_madrid_sin_totales = df_poblacion_madrid_sin_totales.dropna(subset=columnas_poblacion)

In [76]:
df_poblacion_madrid_sin_totales.isnull().sum()

fecha                   0
cod_municipio           0
municipio               0
cod_distrito            0
distrito                0
cod_barrio              0
barrio                  0
num_personas            0
num_personas_hombres    0
num_personas_mujeres    0
dtype: int64

Volcado Datos

In [78]:
df_poblacion_madrid.to_sql('poblacion_madrid', schema='dw_tfm_restaurantes', con = conn, if_exists = 'append', index=False)

64

In [82]:
count_db = pd.read_sql("SELECT COUNT(*) AS count FROM dw_tfm_restaurantes.poblacion_madrid", conn).iloc[0, 0]
count_df = len(df_poblacion_madrid)

print(f"Filas en DataFrame: {count_df}")
print(f"Filas en tabla dw_tfm_restaurantes: {count_db}")

if count_df == count_db:
    print("La carga se efectuó correctamente.")
else:
    print("Hay discrepancias en la cantidad de filas insertadas.")

Filas en DataFrame: 1064
Filas en tabla dw_tfm_restaurantes: 1064
La carga se efectuó correctamente.